# Show Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorSelectionDialog..::..Show Method
ColorSelectionDialog Class See Also
---
Shows the Revit Color dialog as a modal dialog.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ItemSelectionDialogResult Show()
```

Visual Basic
---
```text
Public Function Show As ItemSelectionDialogResult
```

Visual C++
---
```text
public:
ItemSelectionDialogResult Show()
```

# ### Return Value
A status indicating whether the user selected a color or cancelled the dialog without making a selection.
# See Also
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace